# NewXYZ Method (XYZ)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewXYZ Method (XYZ)
Application Class See Also
---
Creates a XYZ object by copying the supplied XYZ object.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ NewXYZ(
	XYZ xyz
)
```

Visual Basic
---
```text
Public Function NewXYZ ( _
	xyz As XYZ _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ NewXYZ(
	XYZ^ xyz
)
```

# ### Parameters
xyz
    Type: Autodesk.Revit.DB..::..XYZThe supplied XYZ object
# See Also
Application Class
NewXYZ Overload
Autodesk.Revit.Creation Namespace